-- MySQL dump 10.13  Distrib 8.0.21, for Linux (x86_64)
--
-- Host: localhost    Database: dj
-- ------------------------------------------------------
-- Server version	8.0.21-0ubuntu0.20.04.4

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `movie_comment`
--

DROP TABLE IF EXISTS `movie_comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `movie_comment` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `n_star` int NOT NULL DEFAULT '0',
  `short_comment` varchar(400) NOT NULL DEFAULT '',
  `comment_date` varchar(10) NOT NULL DEFAULT '1979-01-01',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=100 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `movie_comment`
--

LOCK TABLES `movie_comment` WRITE;
/*!40000 ALTER TABLE `movie_comment` DISABLE KEYS */;
INSERT INTO `movie_comment` VALUES (1,5,'幸运的是爱他的女人存在于真实里。','2008-10-10'),(2,5,'“我的追求带我穿越了物理、形而上学、幻觉，又带了回来”，顶尖科学家的世界已经足够神奇，何况他还有着伟大的爱情。这部电影不仅是纳什的精彩传记，更是对爱情的崇高礼赞——爱是无限，爱是信仰，爱是一切逻辑和原由。','2009-01-23'),(3,4,'什么都好，除了《A Beautiful Mind》这个名字。','2006-07-04'),(4,5,'李笑来老师推荐的一部电影。纳什是历史上第一个广为人知的“用自己的精神战胜了自己的精神病”的人。看的时候不够专注，这是部需要安静认真去看的影片，另现实中精神病始终是一个没有最终被解密的领域，治疗的药物对人的大脑损伤很严重，加速度痴呆和记忆衰退，包括影响性欲。他的爱人其实才是最伟大的','2011-01-14'),(5,5,'你让我相信还真有感情这回事。','2007-02-14'),(6,4,'与我想象中的不一样，很震撼人的传记电影，从中我最大的体会是：做伟人也真不容易啊~~','2007-07-24'),(7,5,'看哭了，在约翰坐在餐厅里，大家挨个来给他送钢笔的时候。','2015-08-09'),(8,4,'前半段觉得好平淡，不知道剧情的话后边还说挺出人意料的，詹妮弗康纳利永远的女神！男主角就是一只萌萌的熊叔吗！估计骚受们肯定喜欢他！','2012-09-08'),(9,5,'这才是真真的传奇，再好的编剧也想不出来吧。','2006-11-29'),(10,5,'有你终生美丽','2005-07-21'),(11,5,'与自己战斗，坚持，勇敢，相信自己。面对一切困境，克服它，朝着自己的理想前进。这是人性的光辉之处，这是人超越一切生物的闪光点。','2008-11-03'),(12,4,'刚看到新闻说John Nash出车祸死了。。。','2015-05-24'),(13,4,'和近日的《万物理论》相映成趣，皆是饱受精神或生理折磨的伟大天才，以及爱上天才的坚强女人。两部传记片皆淡化传主的道德瑕疵，同时对各自妻子也倾于美化。现实生活中，两位妻子都曾因不堪忍受心生恨意，两对皆离婚。可纳什比霍金幸运，艾西莉亚即便离异也从未放弃爱他，两人2001年复婚。简却另嫁他人','2014-11-29'),(14,5,'用精神治好了自己的精神病','2014-06-12'),(15,5,'他是情商最低的人，但他也是最真实的人。','2014-08-30'),(16,4,'所有伟大而美丽的心灵都是孤独的，纳什疯了，是因为他太孤独了。','2012-06-29'),(17,4,'那三只影子好可怜啊，难道幻觉就一定比现实无价值么？这只能由当事人来判定吧？不治好病又如何，我要是他就疯下去，看他之后的萎靡，哪有当年当疯子的意气风发？','2010-04-24'),(18,5,'看三次了。第一次在大学图书馆，第二次在上班以后，第三次是电影频道滚动播放的测试片。每个细节都记得清清楚楚，大概是永远也不会忘记的片子了。','2007-08-08'),(19,5,'很感动的故事，真的可以当成悬疑来看。伟大的人会有不平凡的经历和痛苦，坚强的意志，并且不忘初心。女主角太美了！','2018-03-18'),(20,4,'好的导演，好的演员，好的故事，好的电影。','2008-08-23'),(21,4,'数学果然容易让人精神分裂','2008-11-21'),(22,1,'丑恶的道德投机，这是我看过最光鲜也最无耻的一部人物传记片。当传记片修成此种道路，离建D之路不远了罢。当年奥斯卡的加冕，怎么看都像是36年柏林奥运会的历史讽刺剧。','2011-03-18'),(23,3,'唯一的BUG就是这样一个骚且妩媚而美艳的女人竟然精通数学。对现当代的人物传记片扔提不起兴趣。','2016-11-23'),(24,5,'八年前标注了想看，今天在去北京的高铁上看了。我以为的还真不是我以为的，众人给教授钢笔时真的很激动。','2017-09-27'),(25,5,'纳什的传记，绝对的传奇。影片看过三四遍，每次都还是会为他的故事感动。导演讲故事的能力太强了，一半的时候都可以当成悬疑片来看。','2017-11-09'),(26,4,'以前觉得自己适合去社科院，只搞研究不教书。后来经过陆谷孙和沛公的洗礼后，才发现读了书就更应该好好生活，而教书比写书重要得多。','2016-08-16'),(27,5,'纳什均衡！','2016-09-13'),(28,5,'朗·霍华德一鸣惊人之作，绝妙的剧本、出彩的视听语言(主观镜头,旋转镜头,色调,配乐,蒙太奇)和出神入化的表演让本片达到了传记片的新高度。罗素·克劳戏路足够宽广，却与影帝失之交臂，女神詹妮弗康纳利终获奥斯卡认可。虽然与现实有所出入，但这部神作依然震撼人心。（9.0/10）','2015-05-16'),(29,5,'\"除了失败的爱情结尾几乎无可挑剔。过去一旦无法解决，未来将永远无法成为现在。\"','2008-01-30'),(31,5,'这是我看过的最好的一部人物传记类影片.它不但表现了天才智能巅峰的一面,更重要的是它将人物人生低谷与其傲然绝群的天份互相缠绕一起呈现出来.或许编导已经洞悉,这恰恰是天才属性不可割裂的一部分.常常慨叹,人类中越接近造物主秘密的人越是在精神、思想、灵魂乃至肉体上被摧残得越惨烈,无一例外。','2016-10-15'),(32,4,'无欲则刚','2009-02-02'),(33,4,'纳什疯了','2007-10-07'),(34,5,'爱是一切理由','2016-10-28'),(35,5,'4.5星。罗素·克劳的演技出彩（末尾感觉像是在像《雨人》中达斯汀·霍夫曼的角色致敬）。当然，真实的纳什是个天才，孤独、无情，影片则突出了他孤独的一面，却大体略过了他无情的一面。片中既未提他婚前有私生子，更不提他曾离婚——直至影片上映的2001年才复婚，1994年领诺贝尔奖时，他既未提到爱情的力量，他俩也尚未复婚，猜想也未必坐在台下。作为商业电影，这是可以理解的虚构，它总需要人们对主角产生共情，甚至...','2019-11-17'),(36,4,'看来Ron Howard在《达芬奇密码》前就已经着手研究符号学和密码破解了，这部片子可以看成是他对《哈维》的颠覆，片中Russell Crowe也拿哈维当成笑话说，哈哈~ 天才和疯子只有一线之隔啊，而主人公的成功则靠着那则爱情工程式的坚持','2010-01-29'),(37,4,'我要有这么漂亮的老婆，我也有斗志','2016-07-19'),(38,4,'耐心的看能看出亮点的，心理学的经典影片。传记片也可以拍的这么好看，尤其是最后与小女孩告别的场景，令人心碎。','2013-08-21'),(39,4,'不止一次听到那句“天才和疯子只是一线之隔”。尽管精神分裂，但纳什的精神力量十分强大，作为一个科学家并获得诺贝尔奖真是了不起。还好他的妻子一直爱着他陪伴着他。之前学习纳什均衡的时候完全想像不到他会是这样一位数学家，当大家纷纷把钢笔放到他的桌前以示尊敬时，特别感人。','2018-08-19'),(40,5,'在Princeton的dorm里看这个电影别有一番风味…','2015-11-26'),(41,4,'天才和疯子只有一线之差','2017-04-03'),(42,5,'入门电影含羞补看计划。爱永远是庸俗而明智的升华，你以此生死以此悲欢，理智与情感的每一次对决，都毫无悬念。朗霍华德的作品很大众，在没有强烈风格的同时，让人暖心且无从挑刺，我一度陶醉黑暗的开放式结局，这次却在同样以精神分裂为主题的电影里，被最质朴的情感洗成泪人。','2014-08-05'),(43,5,'感觉不到真实的时候，就是把自己与这个世界强行分离了。重新回到现实中来的方法，让人心走进来。','2012-10-22'),(44,5,'罗素的演技真的太赞了！最爱','2009-07-05'),(45,3,'这种社恐型天才角色不是一般都会有着非常突出的魅力的吗？这部真的没有感觉到，完全无法对男主角共情，甚至觉得前半部的他相当烦人','2017-06-20'),(46,5,'这是一部对我意义非凡的电影，也是我心中永远的痛。2004.5.22 大学宿舍307VCD 2014.5.16 中国电影资料馆艺术影院 “他们就是我的过去，每个人都会被过去缠绕。”','2014-05-16'),(47,5,'与自己，和解','2014-04-27'),(48,5,'想一想，从你所经历过的那些人，那些事，以及珍惜的片刻并没有死去，而是更糟糕的，都不是真的——大名鼎鼎的纳什均衡就是出自这个伟大的家伙。除了学术研究，他还要跟自己的幻觉，从争锋相对到视而不见再到平然处之。','2009-04-08'),(49,4,'哎。。。所以嘛，我高考数学4分，完全没有男主的困扰。。。。坦白讲本以为是个很无聊的传记片，虽然对于这一数学家的处理进行了非常梦幻的加工，但他还是打动了我。。克劳大叔不错哦。。。','2013-05-11'),(50,5,'这么多年过去了，我最大的发现原来是爱情','2006-12-02'),(51,5,'最后还是把我看哭了啊= =虽然片子和我之前的想象完全是大相径庭。天才们似乎总是在与自己的内心抗争，所有的自卑，骄傲，孤高与欲想。','2010-12-20'),(52,5,'164 朗霍华德擅长的工整叙事这次发挥到极致，拉素克劳的演技爆表了，看过的最好的传记片。','2014-05-16'),(53,4,'内心的强大才是真的强大','2011-08-12'),(54,5,'不疯魔，不成话。天才都是疯子','2010-08-25'),(55,5,'朗霍华德确实是拍这种活儿的一把好手，而且内容挺丰富，不仅仅是在讲一个天才的个人困境和抗争，不仅用恰到好处的笔墨展示了伟大的情感，还将冷战的阴影非常可信地描摹出来。黑色惊悚的幻想部分拍得很精彩，其实一开始那个英国佬进屋，就流露出疯癫气。很多搞笑细节均对我奏效（就是影院不尽皆共鸣啊）','2014-05-16'),(56,5,'\"\"\"There are other things besides work.\"\" \"\"What are they?\"\" 最让人痛苦的不是天才如何疯魔，而是在天才眼中，我们都只是凡人。\"','2014-05-18'),(57,4,'#siff#如果你知我苦衷','2015-06-20'),(58,5,'感谢当年的辅导员 钱露营','2011-10-28'),(59,5,'感动!','2017-04-04'),(60,5,'精神世界的流亡与归宿。被放逐者与被眷顾者。','2018-03-12'),(61,4,'“或者，说得更准确一些：从七八十年代的某一天起，他有意识地选择将一部分的疯狂运用在数学的灵感上，而将剩余的疯狂用理性囚禁起来。 ” http://movie.douban.com/review/5379437/','2015-01-11'),(62,5,'天才是孤独的，是脆弱的，是需要被守护的。好在，天才有很多追随者，有人愿意奉献至死不渝的爱情。','2019-03-25'),(63,5,'很感动。我想起了《三体2》和我自己。//20150711中国电影资料馆大银幕。五年后大银幕重温。这五年来看片量增加了1500多部。但依旧还是有所触动。看到好几个熟面孔。还有长大后的黛博拉。四星半','2010-03-20'),(64,4,'Russell Crowe主演的两部影片连续两年蝉联桂冠。Jennifer Connelly没有童年时代那样惊艳了','2008-03-28'),(65,4,'。是爱呀','2017-04-04'),(66,4,'For My Eternal Math','2010-04-05'),(67,4,'感人的人物传记，爱可以创造奇迹！','2017-05-26'),(68,4,'好像在HBO看过 是我第一次看的关于精神分裂的电影','2009-08-18'),(69,4,'好直白的翻译，但也是最贴切的片名！很好看，推荐！','2017-04-08'),(70,5,'2006年巧丽的推荐！真的非常棒！','2010-02-05'),(71,5,'拉塞尔克劳演的咋那么好','2012-06-18'),(72,5,'拉塞尔绝对的影帝','2009-05-20'),(73,4,'不容易啊！','2005-11-20'),(74,5,'无论从画面还是从剧情来看不愧为奥斯卡最佳影片，罗素克劳演的太好了。','2018-08-11'),(75,5,'Creep.','2013-01-02'),(76,5,'有你终生美丽。','2008-04-16'),(77,3,'孤寂心灵最美丽，博弈幻影成三人。钢笔重于诺贝尔，感谢YY感谢妻','2009-12-02'),(78,5,'很主流但又很好看的经典。','2013-10-19'),(79,5,'罗素克劳的演绎实在精彩，让人看了充满活力的说','2012-05-23'),(80,4,'能把传记片拍出冷战的阴云笼罩，还捎带了点谍战片的味道，这个导演也真是有想法，极速风流也是，没准传记片真是最适合他发挥的片种（不过达芬奇密码拍得挺一般的）。色调的处理上也很有时代感，其实比美国队长1做得好，还原度很高。前半部分拍得比后半部分好，我觉得谜底揭开得有点早。','2014-05-17'),(81,4,'这才是真的传奇，再好的编剧也编辑不出来吧','2017-03-14'),(82,5,'\"震撼哦震撼，太帅了哈哈，因为不是刚看完来写的，所以词语好匮乏，总之很不错的，很值得一看\"','2009-12-03'),(84,4,'要去看看博弈论了。。。','2011-09-11'),(85,5,'霍华德这样的顽固脑袋派拍出此惊世之作纯属不易','2009-06-26'),(86,3,'相比卷福的图灵传，差了一些。对女性人物塑造太差，按说纳什太太既然是如此重要的人，可是片子里一直对这个人物几乎没什么着墨。不明白为什么纳什太太可以一直深爱纳什。纳什的病情到底如何好转，片子也描述的不够。基本上就像流水账一样的电影。','2015-05-31'),(87,4,'不错','2007-03-05'),(88,4,'果然天才也不是那么好当的。。。','2017-03-31'),(89,4,'爱情很伟大','2017-03-31'),(90,5,'数学家真不是人干的活','2012-05-08'),(91,5,'故事好，演得也好。最大的魅力在于它表现的是真人真事','2012-06-18'),(92,5,'\"啊啊啊,罗素演技太牛逼了. 演一个神经质的数学家.这片子也挺感人呀.\"','2008-06-08'),(94,4,'ron howard','2009-08-14'),(95,4,'个人世界太强大','2011-01-08'),(96,3,'嘎嘎','2007-08-09'),(97,3,'被勵志了','2012-11-13'),(98,3,'中央六看的','2010-09-23'),(99,1,'此种电影（包括《心灵捕手》）充斥着对理论工作者（本片中还有对精神疾病患者、家属）的stereotype幻想，是一条源自创作者之无知的“康庄”歧途。他们身体力行将反智风潮传向世界~','2017-10-10');
/*!40000 ALTER TABLE `movie_comment` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-09-27  2:06:11
